avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon_sleep/main.c
/**
 * \file main.c
 *
 * \brief Mac Application - No beacon Sleep
 *
 * Copyright (c) 2013-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 */

/**
 * \mainpage
 * \section preface Preface
 * This is the reference manual for the IEEE 802.15.4 MAC No beacon Sleep
 * Application
 * \section main_files Application Files
 *      - main.c                 Application main file.
 * \section intro Application Introduction
 * The basic MAC Example Nobeacon Sleep Application deploys a nonbeacon-enabled
 * network.
 * The first node searching for existing networks, and if no existing network is
 * found on the default channel,
 * this nodes becomes the PAN Coodinator and creates a nonbeacon-enable network.
 * This node has its receiver always
 * enabled.
 * Other nodes that find an already existing network, associate with the PAN
 * Coordiantor and goes
 * to sleep(both MCU and transceiver). For every 2 seconds the device wakes up
 * and sends a data to the coordinator before going to sleep again.
 * For demonstration purposes the coordinator's configuration is limited to
 * associate two devices at maximum.
 * \section api_modules Application Dependent Modules
 * - \subpage api
 * \section compinfo Compilation Info
 * This software was written for the GNU GCC and IAR .
 * Other compilers may or may not work.
 *
 * \section references References
 * 1)  IEEE Std 802.15.4-2006 Part 15.4: Wireless Medium Access Control (MAC)
 *     and Physical Layer (PHY) Specifications for Low-Rate Wireless Personal
 * Area
 *     Networks (WPANs).\n\n
 * 2)  <a href="https://www.microchip.com/support/">Atmel Design
 * Support</a>.\n
 *
 * \section contactinfo Contact Information
 * For further information,visit
 * <A href="http://www.microchip.com/design-centers/8-bit">www.atmel.com</A>.\n
 */

#include <string.h>
#include "conf_board.h"
#include "avr2025_mac.h"
#include "led.h"
#include "delay.h"
#include "common_sw_timer.h"
#include "sleepmgr.h"
#include <asf.h>

/* === TYPES =============================================================== */

typedef struct associated_device_tag {
	uint16_t short_addr;
	uint64_t ieee_addr;
}

/** This type definition of a structure can store the short address and the
 *  extended address of a device.
 */
associated_device_t;

typedef enum node_status_tag {
	COLD_START_RESET,
	PC_RUNNING,
	IDLE,
	TRANSMITTING
} SHORTENUM node_status_t;

/* === MACROS ============================================================== */

/** Defines the PAN ID of the network. */
#ifdef PAN_ID
#define DEFAULT_PAN_ID                  (PAN_ID)
#else
#define DEFAULT_PAN_ID                  CCPU_ENDIAN_TO_LE16(0xBABE)
#endif
/** Defines the short address of the coordinator. */
#define COORD_SHORT_ADDR                (0x0000)
/** Defines the maximum number of devices the coordinator will handle. */
#define MAX_NUMBER_OF_DEVICES           (2)
/** This is the time period in micro seconds for data transmissions. */
#define DATA_TX_PERIOD                  (2000000)

#define CHANNEL_OFFSET                  (0)

#define SCAN_CHANNEL                    (1ul << current_channel)

/** Defines the scan duration time. */
#define SCAN_DURATION                   (4)
/** Defines the maximum number of scans before starting own network. */
#define MAX_NUMBER_OF_SCANS             (3)

#if (LED_COUNT >= 3)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED1)
#define LED_DATA                        (LED2)
#elif (LED_COUNT == 2)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED1)
#else
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED0)
#endif

#define INTER_FRAME_DURATION_US         (200000)

/* === GLOBALS ============================================================= */

/** This structure stores the short and extended address of the coordinator. */
static associated_device_t coord_addr;
/** Number of done network scans */
static uint8_t number_of_scans;
/** This array stores all device related information. */
static associated_device_t device_list[MAX_NUMBER_OF_DEVICES];
/** Current status of the node. */
static node_status_t node_status;

static uint8_t current_channel;
static uint8_t current_channel_page;
static uint32_t channels_supported;

volatile bool timer_flag = false;
volatile bool in_sleep_mode = false;

static uint8_t TIMER_LED_OFF;
static uint8_t WAKE_TIMER;

#ifdef SAM
enum sleepmgr_mode mode = SLEEPMGR_ACTIVE;
#else
enum sleepmgr_mode mode = SLEEPMGR_IDLE;
#endif
/* === PROTOTYPES ========================================================== */

static void app_task(void);
static void network_scan_indication_cb(void *parameter);
static void data_exchange_led_off_cb(void *parameter);
static void awake_timer_cb(void *parameter);
static bool assign_new_short_addr(uint64_t addr64, uint16_t *addr16);
static void app_alert(void);

/* === IMPLEMENTATION ====================================================== */

/*! \brief Main function.
 */
int main(void)
{
	irq_initialize_vectors();
	sysclk_init();

	/* Initialize the board.
	 * The board-specific conf_board.h file contains the configuration of
	 * the board initialization.
	 */
	board_init();

	sw_timer_init();

