avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon_sleep/main.c
#endif  /* (MAC_ORPHAN_INDICATION_RESPONSE == 1) */

#if (MAC_INDIRECT_DATA_BASIC == 1)
void usr_mlme_poll_conf(uint8_t status)
{
}

#endif  /* (MAC_INDIRECT_DATA_BASIC == 1) */

void usr_mlme_reset_conf(uint8_t status)
{
	if (status == MAC_SUCCESS) {
		wpan_mlme_get_req(phyCurrentPage);
	} else {
		/* something went wrong; restart */
		wpan_mlme_reset_req(true);
	}
}

#if (MAC_RX_ENABLE_SUPPORT == 1)
void usr_mlme_rx_enable_conf(uint8_t status)
{
}

#endif  /* (MAC_RX_ENABLE_SUPPORT == 1) */

#if ((MAC_SCAN_ED_REQUEST_CONFIRM == 1)      ||	\
	(MAC_SCAN_ACTIVE_REQUEST_CONFIRM == 1)  || \
	(MAC_SCAN_PASSIVE_REQUEST_CONFIRM == 1) || \
	(MAC_SCAN_ORPHAN_REQUEST_CONFIRM == 1))
void usr_mlme_scan_conf(uint8_t status,
		uint8_t ScanType,
		uint8_t ChannelPage,
		uint32_t UnscannedChannels,
		uint8_t ResultListSize,
		void *ResultList)
{
	number_of_scans++;

	if (status == MAC_SUCCESS) {
		wpan_pandescriptor_t *coordinator;
		uint8_t i;

		/*
		 * Analyze the ResultList.
		 * Assume that the first entry of the result list is our
		 * coodinator.
		 */
		coordinator = (wpan_pandescriptor_t *)ResultList;
		for (i = 0; i < ResultListSize; i++) {
			/*
			 * Check if the PAN descriptor belongs to our
			 * coordinator.
			 * Check if coordinator allows association.
			 */
			if ((coordinator->LogicalChannel == current_channel) &&
					(coordinator->ChannelPage ==
					current_channel_page) &&
					(coordinator->CoordAddrSpec.PANId ==
					DEFAULT_PAN_ID) &&
					((coordinator->SuperframeSpec &
					((uint16_t)1 <<
					ASSOC_PERMIT_BIT_POS)) ==
					((uint16_t)1 << ASSOC_PERMIT_BIT_POS))
					) {
				/* Store the coordinator's address */
				if (coordinator->CoordAddrSpec.AddrMode ==
						WPAN_ADDRMODE_SHORT) {
					ADDR_COPY_DST_SRC_16(
							coord_addr.short_addr,
							coordinator->CoordAddrSpec.Addr.short_address);
				} else if (coordinator->CoordAddrSpec.AddrMode
						== WPAN_ADDRMODE_LONG) {
					ADDR_COPY_DST_SRC_64(
							coord_addr.ieee_addr,
							coordinator->CoordAddrSpec.Addr.long_address);
				} else {
					/* Something went wrong; restart */
					wpan_mlme_reset_req(true);
					return;
				}

				/*
				 * Associate to our coordinator
				 * Use: bool wpan_mlme_associate_req(uint8_t
				 * LogicalChannel,
				 *                                   uint8_t
				 * ChannelPage,
				 *
				 *
				 *
				 *
				 *
				 *                              wpan_addr_spec_t
				 ******CoordAddrSpec,
				 *                                   uint8_t
				 * CapabilityInformation);
				 * This request will cause a mlme associate
				 * confirm message ->
				 * usr_mlme_associate_conf
				 */
				wpan_mlme_associate_req(
						coordinator->LogicalChannel,
						coordinator->ChannelPage,
						&(coordinator->CoordAddrSpec),
						WPAN_CAP_ALLOCADDRESS);
				return;
			}

			/* Get the next PAN descriptor */
			coordinator++;
		}

		/*
		 * If here, the result list does not contain our expected
		 * coordinator.
		 * Let's scan again.
		 */
		if (number_of_scans < MAX_NUMBER_OF_SCANS) {
			wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
					SCAN_CHANNEL,
					SCAN_DURATION,
					current_channel_page);
		} else {
			/* No network could be found; therefore start new
			 * network. */

			/*
			 * Set the short address of this node.
			 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
			 *                             void *PIBAttributeValue);
			 *
			 * This request leads to a set confirm message ->
			 * usr_mlme_set_conf
			 */
			uint8_t short_addr[2];

			short_addr[0] = (uint8_t)COORD_SHORT_ADDR; /* low byte
			                                           **/
			short_addr[1] = (uint8_t)(COORD_SHORT_ADDR >> 8); /*
			                                                   *
			                                                   *
			                                                   *
			                                                   *
			                                                   *high
			                                                   *
			                                                   *
			                                                   *
			                                                   *
			                                                   *byte
			                                                   **/
			wpan_mlme_set_req(macShortAddress, short_addr);
		}
	} else if (status == MAC_NO_BEACON) {
		/*
		 * No beacon is received; no coordiantor is located.
		 * Scan again, but used longer scan duration.
		 */
		if (number_of_scans < MAX_NUMBER_OF_SCANS) {
			wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
					SCAN_CHANNEL,
					SCAN_DURATION,
					current_channel_page);
		} else {
			/* No network could be found; therefore start new
			 * network. */

			/*
			 * Set the short address of this node.
			 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
			 *                             void *PIBAttributeValue);
			 *
			 * This request leads to a set confirm message ->
			 * usr_mlme_set_conf
			 */
			uint8_t short_addr[2];

			short_addr[0] = (uint8_t)COORD_SHORT_ADDR; /* low byte
			                                           **/
			short_addr[1] = (uint8_t)(COORD_SHORT_ADDR >> 8); /*
			                                                   *
			                                                   *
			                                                   *
			                                                   *
			                                                   *high
			                                                   *
			                                                   *
			                                                   *
			                                                   *
			                                                   *byte
			                                                   **/
			wpan_mlme_set_req(macShortAddress, short_addr);
		}
	} else {
		/* Something went wrong; restart */
		wpan_mlme_reset_req(true);
	}

	/* Keep compiler happy. */
	ScanType = ScanType;
	UnscannedChannels = UnscannedChannels;
	ChannelPage = ChannelPage;
}

#endif

