avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon_sleep/main.c
void usr_mlme_set_conf(uint8_t status,
		uint8_t PIBAttribute)
{
	if ((status == MAC_SUCCESS) && (PIBAttribute == macShortAddress)) {
		/*
		 * Allow other devices to associate to this coordinator.
		 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
		 *                             void *PIBAttributeValue);
		 *
		 * This request leads to a set confirm message ->
		 * usr_mlme_set_conf
		 */
		uint8_t association_permit = true;

		wpan_mlme_set_req(macAssociationPermit, &association_permit);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macAssociationPermit)) {
		/*
		 * Set RX on when idle to enable the receiver as default.
		 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
		 *                             void *PIBAttributeValue);
		 *
		 * This request leads to a set confirm message ->
		 * usr_mlme_set_conf
		 */
		bool rx_on_when_idle = true;

		wpan_mlme_set_req(macRxOnWhenIdle, &rx_on_when_idle);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macRxOnWhenIdle)) {
		/*
		 * Start a nonbeacon-enabled network
		 * Use: bool wpan_mlme_start_req(uint16_t PANId,
		 *                               uint8_t LogicalChannel,
		 *                               uint8_t ChannelPage,
		 *                               uint8_t BeaconOrder,
		 *                               uint8_t SuperframeOrder,
		 *                               bool PANCoordinator,
		 *                               bool BatteryLifeExtension,
		 *                               bool CoordRealignment)
		 *
		 * This request leads to a start confirm message ->
		 * usr_mlme_start_conf
		 */
		wpan_mlme_start_req(DEFAULT_PAN_ID,
				current_channel,
				current_channel_page,
				15, 15,
				true, false, false);
	} else {
		/* something went wrong; restart */
		wpan_mlme_reset_req(true);
	}
}

#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{
	if (status == MAC_SUCCESS) {
		node_status = PC_RUNNING;

		/*
		 * Network is established.
		 * Waiting for association indication from a device.
		 * -> usr_mlme_associate_ind
		 */
		/* Stop timer used for search indication */
		sw_timer_stop(TIMER_LED_OFF);
		LED_On(LED_NWK_SETUP);
	} else {
		/* something went wrong; restart */
		wpan_mlme_reset_req(true);
	}
}

#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

void usr_mlme_sync_loss_ind(uint8_t LossReason,
		uint16_t PANId,
		uint8_t LogicalChannel,
		uint8_t ChannelPage)
{
}

static bool assign_new_short_addr(uint64_t addr64, uint16_t *addr16)
{
	uint8_t i;

	/* Check if device has been associated before */
	for (i = 0; i < MAX_NUMBER_OF_DEVICES; i++) {
		if (device_list[i].short_addr == 0x0000) {
			/* If the short address is 0x0000, it has not been used
			 * before */
			continue;
		}

		if (device_list[i].ieee_addr == addr64) {
			/* Assign the previously assigned short address again */
			*addr16 = device_list[i].short_addr;
			return true;
		}
	}

	for (i = 0; i < MAX_NUMBER_OF_DEVICES; i++) {
		if (device_list[i].short_addr == 0x0000) {
			*addr16 = CPU_ENDIAN_TO_LE16(i + 0x0001);
			device_list[i].short_addr = CPU_ENDIAN_TO_LE16(
					i + 0x0001);                    /* get
			                                                 * next
			                                                 * short
			                                                 *
			                                                 *
			                                                 *
			                                                 *
			                                                 *address
			                                                 **/
			device_list[i].ieee_addr = addr64; /* store extended
			                                    * address */
			return true;
		}
	}

	/* If we are here, no short address could be assigned. */
	return false;
}

static void app_alert(void)
{
	while (1) {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

static void network_scan_indication_cb(void *parameter)
{
	LED_Toggle(LED_NWK_SETUP);

	/* Re-start led timer again */
	sw_timer_start(TIMER_LED_OFF,
			500000,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)network_scan_indication_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}

static void data_exchange_led_off_cb(void *parameter)
{
	LED_Off(LED_DATA);

	parameter = parameter; /* Keep compiler happy. */
}

static void app_task(void)
{
	switch (node_status) {
	case IDLE:
	{
		if (timer_flag) {
			timer_flag = false;
			LED_On(LED_DATA);

			node_status = TRANSMITTING;

			/*
			 * Send some data and put MCU to sleep again.
			 * Use: bool wpan_mcps_data_req(uint8_t SrcAddrMode,
			 *                              wpan_addr_spec_t
			 ******DstAddrSpec,
			 *                              uint8_t msduLength,
			 *                              uint8_t *msdu,
			 *                              uint8_t msduHandle,
			 *                              uint8_t TxOptions);
			 *
			 * This request will cause a mcps data confirm message
			 *->
			 * usr_mcps_data_conf
			 */

			uint8_t src_addr_mode;
			wpan_addr_spec_t dst_addr;
			uint8_t payload;
			static uint8_t msduHandle = 0;

			src_addr_mode = WPAN_ADDRMODE_SHORT;

			dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
			dst_addr.PANId = DEFAULT_PAN_ID;
			ADDR_COPY_DST_SRC_16(dst_addr.Addr.short_address,
					coord_addr.short_addr);

			payload = (uint8_t)rand();          /* any dummy data */
			msduHandle++;                       /* increment handle
				                            **/
			wpan_mcps_data_req(src_addr_mode,
					&dst_addr,
					1,
					&payload,
					msduHandle,
					WPAN_TXOPT_ACK);
		} else {
			/*
			 * The MCU will wake up again, once the buttons is
			 * pressed
			 * on the board.Since no button pressed now set system
			 * to sleep.
			 * Set MCU to sleep if stack is not busy
			 */
			if (mac_ready_to_sleep() && in_sleep_mode == false) {
				in_sleep_mode = true;
				sleepmgr_init();
				sleepmgr_lock_mode(mode);
				sleepmgr_enter_sleep();
			}

			/* MCU is awake again */
		}
	}
	break;

	default:
		/* Do nothing. */
		break;
	}
}

static void awake_timer_cb(void *parameter)
{
	timer_flag = true;
	in_sleep_mode = false;

	sw_timer_start(TIMER_LED_OFF,
			DATA_TX_PERIOD,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)awake_timer_cb,
			NULL);
}
